Classes | Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::ElbowDefault Class Referencefinal
MEP Element Manager
The ElbowDefault contains the necessary non-geometric data for modifying an Elbow. More...
#include <MEPElbowDefault.hpp>
 Inheritance diagram for ACAPI::MEP::ElbowDefault:
 Classes
class  | Modifier
Modifier of the ElbowDefault. More...
 Public Member Functions
Result< double >  | GetFactorRadius () const
The radius of the Elbow is calculated with the help of this value in the case of Duct and Cable Carrier.
Result< UniqueID >  | GetPreferenceTable () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
ElbowDefault (std::shared_ptr< Impl::IElbowDefaultImpl > impl)
Constructs an ElbowDefault with the given ElbowDefault implementation.
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Static Protected Member Functions
static Result< ElbowDefault >  | Create (const API_Token &token, Domain domain)
Creates an ElbowDefault with the given token and domain.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< ElbowDefault >  | CreateElbowDefault (Domain domain)
Creates an ElbowDefault.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The ElbowDefault contains the necessary non-geometric data for modifying an Elbow.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault and RoutingNodeDefault
Constructor & Destructor Documentation
◆ ElbowDefault()
 ACAPI::MEP::ElbowDefault::ElbowDefault  |  ( |  std::shared_ptr< Impl::IElbowDefaultImpl > |  impl | )
protected
Constructs an ElbowDefault with the given ElbowDefault implementation.
Parameters
impl | The given ElbowDefault implementation.
Member Function Documentation
◆ Create()
 static Result< ElbowDefault > ACAPI::MEP::ElbowDefault::Create  |  ( |  const API_Token & |  token,
|  Domain |  domain )
staticprotected
Creates an ElbowDefault with the given token and domain.
Parameters
token | The given token.
domain | The given domain.
Returns
The result of the creation with the created ElbowDefault.
◆ GetFactorRadius()
 Result< double > ACAPI::MEP::ElbowDefault::GetFactorRadius  |  ( |   | ) |   const
The radius of the Elbow is calculated with the help of this value in the case of Duct and Cable Carrier.
Returns
Returns the factor of the ElbowDefault in the case of Duct and Cable Carrier, otherwise Error.
◆ GetPreferenceTable()
 Result< UniqueID > ACAPI::MEP::ElbowDefault::GetPreferenceTable  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable of a PipeElbowDefault or a DuctElbowDefault, in case of CableCarrierElbowDefault returns Error.
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::ElbowDefault::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateElbowDefault
 Result< ElbowDefault > CreateElbowDefault  |  ( |  Domain |  domain | )
friend
Creates an ElbowDefault.
Parameters
domain | The Domain of the requested ElbowDefault.
Returns
If able, returns a copy of Archicad's current Default of the Elbow from the RoutingElement tool for the domain defined by the parameter, otherwise Error.